Revit 2027 API
ColorFillScheme.AddEntry Method
 Adds new entry to the scheme.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddEntry(
	ColorFillSchemeEntry entry
)
Public Sub AddEntry (
	entry As ColorFillSchemeEntry
)
public:
void AddEntry(
	ColorFillSchemeEntry^ entry
)
member AddEntry :
        entry : ColorFillSchemeEntry -> unit
Parameters
entry ColorFillSchemeEntry
Exceptions
Exception | Condition
ArgumentException |  There already exists an entry with the same value in the scheme. -or- The entry value is out of range. -or- The scheme and the entry have different parameter storage type. -or- The fill pattern id is not valid for scheme.
ArgumentNullException |  A non-optional argument was null
Remarks
 To make sure that entry can be added to the scheme, call IsEntryConsistentWithScheme(ColorFillSchemeEntry) first.
See Also
Reference
ColorFillScheme Class
Autodesk.Revit.DB Namespace